Revit 2027 API
RevitLinkType.LocallyUnloaded Property
 Checks whether a Revit link in a local model is unloaded only for the current user.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool LocallyUnloaded { get; }
Public ReadOnly Property LocallyUnloaded As Boolean
	Get
public:
property bool LocallyUnloaded {
	bool get ();
}
member LocallyUnloaded : bool with get
Property Value
Boolean
Remarks
 Revit links can be unloaded for both the current user and for all users. If a Revit link is in a non-workshared file or in central model, this property is false.
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace